; domain
(define (domain bomberda)
    (:requirements :strips)
    (:types
        agent position timer
    )
    (:predicates
        (inc ?a ?b - position)
        (dec ?a ?b - position)
        (at ?a - agent ?x ?y - position)
        (wall ?x ?y)
        (is-enemy ?a)
        (has-enemy)
        (has-action)
        (check-is-dead)
        (is-dead)
        (enemy-move)
        (enemy-up)
        (enemy-down)
        (enemy-left)
        (enemy-right)
        (check-from-enemy)
        (has-bomb)
        (bomb-at ?x ?y)
        (current-bomb-timer ?t - timer)
        (is-max-timer ?t - timer)
        (is-zero-timer ?t - timer)
        (dec-timer ?a ?b - timer)
        (check-bomb)
    )

    (:action SOLTARBOMBA
        :parameters (?px ?py - position ?player - agent ?t - timer)
        :precondition (and (not (has-bomb)) (not (is-enemy ?player)) (at ?player ?px ?py) (is-max-timer ?t))
        :effect (and (bomb-at ?px ?py) (current-bomb-timer ?t) (has-bomb))
    )

    (:action PASSAR_TURNO_BOMBA
        :parameters ()
        :precondition (and (check-bomb) (not (has-bomb)))
        :effect (and (not (check-bomb)) (not (has-action)))
    )
    

    (:action DECREMENTAR_TIMER_BOMBA
        :parameters (?t ?n - timer)
        :precondition (and (check-bomb) (has-bomb) (current-bomb-timer ?t) (dec-timer ?t ?n) (not (is-zero-timer ?n)))
        :effect (and
                    (not (check-bomb))
                    (not (current-bomb-timer ?t))
                    (not (has-action))
                    (current-bomb-timer ?n)
                )
    )

    (:action EXPLODIR_BOMBA
        :parameters (?t ?n - timer ?player ?enemy - agent)
        :precondition (and (check-bomb) (has-bomb) (current-bomb-timer ?t) (dec-timer ?t ?n) (is-zero-timer ?n) (is-enemy ?enemy) (not (is-enemy ?player)))
        :effect (and 
                    (not (bomb-at ?bx ?by))
                    (not (check-bomb))
                    (not (has-bomb))
                    (not (has-action))
                    (not (current-bomb-timer ?t))
                    (forall (?x ?y ?w - position) 
                        (when
                            (and
                                (bomb-at ?x ?y)
                                (or 
                                    (at ?enemy ?x ?w)
                                    (at ?enemy ?w ?y)
                                    (at ?enemy ?x ?y)
                                )
                                (or
                                    (inc ?x ?w)
                                    (inc ?y ?w)
                                    (dec ?x ?w)
                                    (dec ?y ?w)
                                )    
                            ) 
                            (not (has-enemy)))
                    )
                    (forall (?x ?y ?w - position) 
                        (when
                            (and
                                (bomb-at ?x ?y)
                                (or 
                                    (at ?player ?x ?w)
                                    (at ?player ?w ?y)
                                    (at ?player ?x ?y)
                                )
                                (or
                                    (inc ?x ?w)
                                    (inc ?y ?w)
                                    (dec ?x ?w)
                                    (dec ?y ?w)
                                )    
                            ) 
                            (is-dead))
                    )
                )
    )
    
    

    (:action CHECK_DEAD
        :parameters (?px ?py ?ex ?ey - position ?player ?enemy - agent)
        :precondition (and (has-enemy) (check-is-dead) (is-enemy ?enemy) (not (is-enemy ?player)) (at ?player ?px ?py) (at ?enemy ?ex ?ey))
        :effect (and
            (when
                (and (at ?player ?px ?py) (at ?enemy ?px ?py))
                (is-dead))
            (not (check-is-dead))
            (when (not (check-from-enemy)) (enemy-move))
            (when (check-from-enemy) (and (not (check-from-enemy)) (check-bomb)))
        )
    )

    (:action CHECK_DEAD_WITHOUT_ENEMY
        :parameters ()
        :precondition (and (not (has-enemy)) (check-is-dead))
        :effect (and (check-bomb) (not (check-is-dead)))
    )

    (:action CIMA
        :parameters (?player - agent)
        :precondition (and (not (has-action)) (not (is-enemy ?player)))
        :effect (forall
                    (?x ?y ?yn - position)
                    (when
                        (and (at ?player ?x ?y)
                            (dec ?y ?yn)
                            (not (wall ?x ?yn)))
                        (and (not (at ?player ?x ?y))
                            (at ?player ?x ?yn)
                            (enemy-down)
                            (has-action)
                            (check-is-dead))
                    )
                )
    )

    (:action BAIXO
        :parameters (?player - agent)
        :precondition (and (not (has-action)) (not (is-enemy ?player)))
        :effect (forall
                    (?x ?y ?yn - position)
                    (when
                        (and (at ?player ?x ?y)
                            (inc ?y ?yn)
                            (not (wall ?x ?yn)))
                        (and (not (at ?player ?x ?y))
                            (at ?player ?x ?yn)
                            (enemy-up)
                            (has-action)
                            (check-is-dead))
                    )
                )
    )

    (:action DIREITA
        :parameters (?player - agent)
        :precondition (and (not (has-action)) (not (is-enemy ?player)))
        :effect (forall
                    (?x ?y ?xn - position)
                    (when
                        (and (at ?player ?x ?y)
                            (inc ?x ?xn)
                            (not (wall ?xn ?y)))
                        (and (not (at ?player ?x ?y))
                            (at ?player ?xn ?y)
                            (enemy-left)
                            (has-action)
                            (check-is-dead))
                    )
                )
    )

    (:action ESQUERDA
        :parameters (?player - agent)
        :precondition (and (not (has-action)) (not (is-enemy ?player)))
        :effect (forall
                    (?x ?y ?xn - position)
                    (when
                        (and (at ?player ?x ?y)
                            (dec ?x ?xn)
                            (not (wall ?xn ?y)))
                        (and (not (at ?player ?x ?y))
                            (at ?player ?xn ?y)
                            (enemy-right)
                            (has-action)
                            (check-is-dead))
                    )
                )
    )
    

    (:action INIMIGO_DIREITA
        :parameters (?enemy - agent)
        :precondition (and (enemy-move) (enemy-right) (is-enemy ?enemy))
        :effect (and
            (forall
                (?x ?y ?xn - position)
                (when
                    (and (at ?enemy ?x ?y)
                        (inc ?x ?xn)
                        (not (wall ?xn ?y)))
                    (and (not (at ?enemy ?x ?y))
                        (at ?enemy ?xn ?y))
                )
            )
            (not (enemy-move))
            (not (enemy-right))
            (check-is-dead)
            (check-from-enemy)
        )
    )

    (:action INIMIGO_ESQUERDA
        :parameters (?enemy - agent)
        :precondition (and (enemy-move) (enemy-left) (is-enemy ?enemy))
        :effect (and
            (forall
                (?x ?y ?xn - position)
                (when
                    (and (at ?enemy ?x ?y)
                        (dec ?x ?xn)
                        (not (wall ?xn ?y)))
                    (and (not (at ?enemy ?x ?y))
                         (at ?enemy ?xn ?y))
                )
            )
            (not (enemy-move))
            (not (enemy-left))
            (check-is-dead)
            (check-from-enemy)
        )
    )

    (:action INIMIGO_CIMA
        :parameters (?enemy - agent)
        :precondition (and (enemy-move) (enemy-up) (is-enemy ?enemy))
        :effect (and
            (forall
                (?x ?y ?yn - position)
                (when
                    (and (at ?enemy ?x ?y)
                        (dec ?y ?yn)
                        (not (wall ?x ?yn)))
                    (and (not (at ?enemy ?x ?y))
                        (at ?enemy ?x ?yn))
                )
            )
            (not (enemy-move))
            (not (enemy-up))
            (check-is-dead)
            (check-from-enemy)
        )
    )

    (:action INIMIGO_BAIXO
        :parameters (?enemy - agent)
        :precondition (and (enemy-move) (enemy-down) (is-enemy ?enemy))
        :effect (and
            (forall
                (?x ?y ?yn - position)
                (when
                    (and (at ?enemy ?x ?y)
                        (inc ?y ?yn)
                        (not (wall ?x ?yn)))
                    (and (not (at ?enemy ?x ?y))
                        (at ?enemy ?x ?yn))
                )
            )
            (not (enemy-move))
            (not (enemy-down))
            (check-is-dead)
            (check-from-enemy)
        )
    )
)

; problem
(define (problem bomberdaproblem)
        (:domain bomberda)
        (:objects x1 x2 x3 x4 x5 y1 y2 y3 y4 y5 y6 y7 - position
                    bomberman enemy - agent
                    t0 t1 t2 t3 - timer)
        (:init 
            (wall x1 y1) (wall x2 y1) (wall x3 y1) (wall x1 y2) (wall x3 y2) (wall x1 y3) (wall x3 y3) (wall x4 y3) (wall x5 y3) (wall x1 y4) (wall x3 y4) (wall x5 y4) (wall x1 y5) (wall x5 y5) (wall x1 y6) (wall x3 y6) (wall x4 y6) (wall x5 y6) (wall x1 y7) (wall x2 y7) (wall x3 y7)
            (inc x1 x2) (inc x2 x3) (inc x3 x4) (inc x4 x5)
            (inc y1 y2) (inc y2 y3) (inc y3 y4) (inc y4 y5) (inc y5 y6) (inc y6 y7)
            (dec x5 x4) (dec x4 x3) (dec x3 x2) (dec x2 x1)
            (dec y7 y6) (dec y6 y5) (dec y5 y4) (dec y4 y3) (dec y3 y2) (dec y2 y1)
            (at bomberman x2 y6)
            (at enemy x2 y3) (is-enemy enemy) (has-enemy)
            (is-zero-timer t0) (is-max-timer t3)
            (dec-timer t3 t2) (dec-timer t2 t1) (dec-timer t1 t0)
        )
        (:goal
            (and
                (not (is-dead))
                (not (has-action))
                (at bomberman x2 y2)
            )
        )
    )

; plan
1. (cima bomberman)
   deleted: (at bomberman x2 y6)
   added: (at bomberman x2 y5) (enemy-down) (has-action) (check-is-dead)
   goals met: 1 of 3
2. (check_dead x2 y5 x2 y3 bomberman enemy)
   deleted: (check-is-dead)
   added: (enemy-move)
   goals met: 1 of 3
3. (inimigo_baixo enemy)
   deleted: (at enemy x2 y3) (enemy-move) (enemy-down)
   added: (at enemy x2 y4) (check-is-dead) (check-from-enemy)
   goals met: 1 of 3
4. (check_dead x2 y5 x2 y4 bomberman enemy)
   deleted: (check-is-dead) (check-from-enemy)
   added: (check-bomb)
   goals met: 1 of 3
5. (soltarbomba x2 y5 bomberman t3)
   added: (bomb-at x2 y5) (current-bomb-timer t3) (has-bomb)
   goals met: 1 of 3
6. (decrementar_timer_bomba t3 t2)
   deleted: (check-bomb) (current-bomb-timer t3) (has-action)
   added: (current-bomb-timer t2)
   goals met: 2 of 3
7. (direita bomberman)
   deleted: (at bomberman x2 y5)
   added: (at bomberman x3 y5) (enemy-left) (has-action) (check-is-dead)
   goals met: 1 of 3
8. (check_dead x3 y5 x2 y4 bomberman enemy)
   deleted: (check-is-dead)
   added: (enemy-move)
   goals met: 1 of 3
9. (inimigo_esquerda enemy)
   deleted: (enemy-move) (enemy-left)
   added: (check-is-dead) (check-from-enemy)
   goals met: 1 of 3
10. (check_dead x3 y5 x2 y4 bomberman enemy)
   deleted: (check-is-dead) (check-from-enemy)
   added: (check-bomb)
   goals met: 1 of 3
11. (decrementar_timer_bomba t2 t1)
   deleted: (check-bomb) (current-bomb-timer t2) (has-action)
   added: (current-bomb-timer t1)
   goals met: 2 of 3
12. (direita bomberman)
   deleted: (at bomberman x3 y5)
   added: (at bomberman x4 y5) (enemy-left) (has-action) (check-is-dead)
   goals met: 1 of 3
13. (check_dead x4 y5 x2 y4 bomberman enemy)
   deleted: (check-is-dead)
   added: (enemy-move)
   goals met: 1 of 3
14. (inimigo_esquerda enemy)
   deleted: (enemy-move) (enemy-left)
   added: (check-is-dead) (check-from-enemy)
   goals met: 1 of 3
15. (check_dead x4 y5 x2 y4 bomberman enemy)
   deleted: (check-is-dead) (check-from-enemy)
   added: (check-bomb)
   goals met: 1 of 3
16. (explodir_bomba t1 t0 bomberman enemy)
   deleted: (check-bomb) (has-bomb) (has-action) (current-bomb-timer t1) (has-enemy)
   goals met: 2 of 3
17. (esquerda bomberman)
   deleted: (at bomberman x4 y5)
   added: (at bomberman x3 y5) (enemy-right) (has-action) (check-is-dead)
   goals met: 1 of 3
18. (check_dead_without_enemy)
   deleted: (check-is-dead)
   added: (check-bomb)
   goals met: 1 of 3
19. (passar_turno_bomba)
   deleted: (check-bomb) (has-action)
   goals met: 2 of 3
20. (esquerda bomberman)
   deleted: (at bomberman x3 y5)
   added: (at bomberman x2 y5) (has-action) (check-is-dead)
   goals met: 1 of 3
21. (check_dead_without_enemy)
   deleted: (check-is-dead)
   added: (check-bomb)
   goals met: 1 of 3
22. (passar_turno_bomba)
   deleted: (check-bomb) (has-action)
   goals met: 2 of 3
23. (cima bomberman)
   deleted: (at bomberman x2 y5)
   added: (at bomberman x2 y4) (enemy-down) (has-action) (check-is-dead)
   goals met: 1 of 3
24. (check_dead_without_enemy)
   deleted: (check-is-dead)
   added: (check-bomb)
   goals met: 1 of 3
25. (passar_turno_bomba)
   deleted: (check-bomb) (has-action)
   goals met: 2 of 3
26. (cima bomberman)
   deleted: (at bomberman x2 y4)
   added: (at bomberman x2 y3) (has-action) (check-is-dead)
   goals met: 1 of 3
27. (check_dead_without_enemy)
   deleted: (check-is-dead)
   added: (check-bomb)
   goals met: 1 of 3
28. (passar_turno_bomba)
   deleted: (check-bomb) (has-action)
   goals met: 2 of 3
29. (cima bomberman)
   deleted: (at bomberman x2 y3)
   added: (at bomberman x2 y2) (has-action) (check-is-dead)
   goals met: 2 of 3
30. (check_dead_without_enemy)
   deleted: (check-is-dead)
   added: (check-bomb)
   goals met: 2 of 3
31. (passar_turno_bomba)
   deleted: (check-bomb) (has-action)
   goals met: 3 of 3
